[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:66:16
                   Personal Schedules
                 </Nav.Link>
               )}
-              {hasRole(currentUser, "ROLE_USER") && (
-                <Nav.Link href="/" data-testid="appnavbar-mainsearch-list">
-                  Main Search
-                </Nav.Link>
-              )}
+              {true}
             </Nav>
 
killedBy: AppNavbar tests renders Personal Schedules and Courses links correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: Main Search. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="color-nav navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:66:16
                   Personal Schedules
                 </Nav.Link>
               )}
-              {hasRole(currentUser, "ROLE_USER") && (
-                <Nav.Link href="/" data-testid="appnavbar-mainsearch-list">
-                  Main Search
-                </Nav.Link>
-              )}
+              {hasRole(currentUser, "ROLE_USER") || <Nav.Link href="/" data-testid="appnavbar-mainsearch-list">
+                  Main Search
+                </Nav.Link>}
             </Nav>
 
killedBy: AppNavbar tests renders Personal Schedules and Courses links correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: Main Search. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="color-nav navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
    >
