[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:57:7
     (section) => section.section.enrollCode === enrollCode,
   );
 
-  if (section) {
+  if (false) {
     // Extract the courseId and section number from the found section
     const courseId = section.courseInfo.courseId;
killedBy: isLectureWithSections should return true when the section is a lecture but there are other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
main/components/Sections/SectionsTable.js:61:30
     // Extract the courseId and section number from the found section
     const courseId = section.courseInfo.courseId;
     // const sectionNumber = section.section.section
-    const sectionNumberEnd = section.section.section.slice(2);
+    const sectionNumberEnd = section.section.section;
 
     if (sectionNumberEnd === "00") {
killedBy: isLectureWithSections should return true when the section is a lecture but there are other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.js:82:13
   return {
     url: "/api/courses/post",
     method: "POST",
-    params: {
-      enrollCd: data.enrollCd.toString(),
-      psId: data.psId.toString(),
-    },
+    params: {},
   };
 };
killedBy: objectToAxiosParams should return the correct axios parameters
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

  Object {
    "method": "POST",
-   "params": Object {

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.js:137:5
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value } }) => `${value}`,
     },
-    {
-      Header: "Course ID",
-      accessor: "courseInfo.courseId",
-
-      Cell: ({ cell: { value } }) => value.substring(0, value.length - 2),
-    },
+    {},
     {
       Header: "Title",
killedBy: Section tests calls onSuccess when mutation is successful and calls toast with correct parameters
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:236:26
       accessor: "section.enrollCode",
       disableGroupBy: true,
       // No need for accessor if it's purely for actions like expand/collapse
-      Cell: ({ row }) => {
-        // Stryker disable all : difficult to test modal interaction
-        /* istanbul ignore next : difficult to test modal interaction*/
-        if (isSection(row.original.section.section) && currentUser.loggedIn) {
-          return (
-            <div className="d-flex align-items-center gap-2">
-              <AddToScheduleModal
-                section={row.original}
-                onAdd={(section, schedule) =>
-                  handleAddToSchedule(section, schedule, mutation)
-                }
-              />
-            </div>
-          );
-        } else {
-          return null;
-        }
-        // Stryker restore all
-      },
+      Cell: ({ row }) => {},
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value }, row }) => /* istanbul ignore next */ {
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
