[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:70:14
       );
       // Stryker restore all
       // Check if there is only one section for the course
-      return courseSections.length > 1;
+      return true;
     }
   }
killedBy: isLectureWithSections should return false when the section is a lecture with no other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
