[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:43:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="me-auto">
-              {systemInfo?.springH2ConsoleEnabled && (
-                <>
-                  <Nav.Link href="/h2-console/index.html">H2Console </Nav.Link>
-                </>
-              )}
+              {false}
               {systemInfo?.showSwaggerUILink && (
                 <>
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: Error: Unable to find an element with the text: H2Console. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="color-nav navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
    >
