[Killed] ObjectLiteral
main/components/Sections/SectionsTable.js:188:5
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value } }) => `${value}`,
     },
-    {
-      Header: "Enroll Code",
-      accessor: "section.enrollCode",
-      disableGroupBy: true,
-      Cell: ({ cell: { value } }) => {
-        return value;
-      },
-      aggregate: getFirstVal,
-      Aggregated: ({ cell: { value } }) => /* istanbul ignore next */ {
-        return `${value}`;
-      },
-    },
+    {},
     {
       Header: "Info",
killedBy: Section tests calls onSuccess when mutation is successful and calls toast with correct parameters
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:192:38
       Header: "Enroll Code",
       accessor: "section.enrollCode",
       disableGroupBy: true,
-      Cell: ({ cell: { value } }) => {
-        return value;
-      },
+      Cell: ({ cell: { value } }) => {},
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value } }) => /* istanbul ignore next */ {
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:196:71
         return value;
       },
       aggregate: getFirstVal,
-      Aggregated: ({ cell: { value } }) => /* istanbul ignore next */ {
-        return `${value}`;
-      },
+      Aggregated: ({ cell: { value } }) => /* istanbul ignore next */ {},
     },
     {
killedBy: Section tests calls onSuccess when mutation is successful and calls toast with correct parameters
statusReason: Error: Aggregated(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
