[Killed] BlockStatement
main/components/Sections/SectionsTable.js:192:57
       Header: "Enroll Code",
       accessor: "section.enrollCode",
       disableGroupBy: true,
-      Cell: ({ cell: { value }, row: { original } }) => {
-        // Stryker disable all : difficult to test modal interaction
-        /* istanbul ignore next : difficult to test modal interaction*/
-        if (isSection(original.section.section) && currentUser.loggedIn) {
-          return (
-            <div className="d-flex align-items-center gap-2">
-              <span>{value}</span>
-              <AddToScheduleModal
-                section={original}
-                quarter={original.courseInfo.quarter}
-                onAdd={(section, schedule) =>
-                  handleAddToSchedule(section, schedule, mutation)
-                }
-              />
-            </div>
-          );
-        } else {
-          return value;
-        }
-        // Stryker restore all
-      },
+      Cell: ({ cell: { value }, row: { original } }) => {},
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value } }) => /* istanbul ignore next */ {
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
