[Killed] ArrowFunction
main/components/PersonalSchedules/AddToScheduleModal.js:38:42
 
   return (
     <>
-      <Button variant="success" onClick={() => setShowModal(true)}>
+      <Button variant="success" onClick={() => undefined}>
         Add
       </Button>
killedBy: AddToScheduleModal opens and closes the modal
statusReason: TestingLibraryElementError: Unable to find an element with the text: Add to Schedule. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <button
      class="btn btn-success"
      type="button"
    >

[Killed] BooleanLiteral
main/components/PersonalSchedules/AddToScheduleModal.js:38:61
 
   return (
     <>
-      <Button variant="success" onClick={() => setShowModal(true)}>
+      <Button variant="success" onClick={() => setShowModal(false)}>
         Add
       </Button>
killedBy: AddToScheduleModal opens and closes the modal
statusReason: TestingLibraryElementError: Unable to find an element with the text: Add to Schedule. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <button
      class="btn btn-success"
      type="button"
    >

[Killed] EqualityOperator
main/components/PersonalSchedules/AddToScheduleModal.js:48:42
         <Modal.Body>
           <Form>
             {
-              /* istanbul ignore next */ filteringSchedules.length > 0 ? (                
+              /* istanbul ignore next */ filteringSchedules.length <= 0 ? (                
                 <Form.Group controlId="scheduleSelect">
                   <Form.Label>Select Schedule</Form.Label>
killedBy: AddToScheduleModal displays correct message when no schedules found
statusReason: TestingLibraryElementError: Unable to find an element with the text: There are no personal schedules for S24.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 2048px;"
>
  <div>

[Killed] EqualityOperator
main/components/PersonalSchedules/AddToScheduleModal.js:48:42
         <Modal.Body>
           <Form>
             {
-              /* istanbul ignore next */ filteringSchedules.length > 0 ? (                
+              /* istanbul ignore next */ filteringSchedules.length >= 0 ? (                
                 <Form.Group controlId="scheduleSelect">
                   <Form.Label>Select Schedule</Form.Label>
killedBy: AddToScheduleModal displays correct message when no schedules found
statusReason: TestingLibraryElementError: Unable to find an element with the text: There are no personal schedules for S24.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 2048px;"
>
  <div>
