[Killed] BlockStatement
main/components/PersonalSchedules/PersonalScheduleSelector.js:15:19
 }) => {
   const [scheduleState, setScheduleState] = useState(schedule);
 
-  useEffect(() => {
-    if (filteringSchedules && filteringSchedules.length > 0) {
-      setSchedule(filteringSchedules[0].id);
-    }
-  }, [filteringSchedules, setSchedule]);
+  useEffect(() => {}, [filteringSchedules, setSchedule]);
 
   const handleScheduleOnChange = (event) => {
killedBy: PersonalScheduleSelector sets the initial schedule when schedules are loaded
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "schedule1"

Number of calls: 0

[Killed] EqualityOperator
main/components/PersonalSchedules/PersonalScheduleSelector.js:16:31
   const [scheduleState, setScheduleState] = useState(schedule);
 
   useEffect(() => {
-    if (filteringSchedules && filteringSchedules.length > 0) {
+    if (filteringSchedules && filteringSchedules.length >= 0) {
       setSchedule(filteringSchedules[0].id);
     }
killedBy: PersonalScheduleSelector sets the initial schedule when schedules are loaded
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleSelector.js:16:9
   const [scheduleState, setScheduleState] = useState(schedule);
 
   useEffect(() => {
-    if (filteringSchedules && filteringSchedules.length > 0) {
+    if (false) {
       setSchedule(filteringSchedules[0].id);
     }
killedBy: PersonalScheduleSelector sets the initial schedule when schedules are loaded
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "schedule1"

Number of calls: 0

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleSelector.js:39:10
         value={scheduleState}
         onChange={handleScheduleOnChange}
       >
-        {filteringSchedules && filteringSchedules.map((schedule) => ( 
-            <option key={schedule.id} value={schedule.id}>
-              {yyyyqToQyy(schedule.quarter)} {schedule.name}
-            </option>
-          ))}
+        {true}
       </Form.Control>
     </Form.Group>
killedBy: PersonalScheduleSelector sets the initial schedule from the schedule prop
statusReason: TestingLibraryElementError: Unable to find an element with the display value: S24 Schedule 1.

<body>
  <div>
    <div>
      <label
        class="form-label"
      >

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleSelector.js:39:10
         value={scheduleState}
         onChange={handleScheduleOnChange}
       >
-        {filteringSchedules && filteringSchedules.map((schedule) => ( 
-            <option key={schedule.id} value={schedule.id}>
-              {yyyyqToQyy(schedule.quarter)} {schedule.name}
-            </option>
-          ))}
+        {false}
       </Form.Control>
     </Form.Group>
killedBy: PersonalScheduleSelector sets the initial schedule from the schedule prop
statusReason: TestingLibraryElementError: Unable to find an element with the display value: S24 Schedule 1.

<body>
  <div>
    <div>
      <label
        class="form-label"
      >
