[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleSelector.js:39:10
         value={scheduleState}
         onChange={handleScheduleOnChange}
       >
-        {filteringSchedules &&
-          filteringSchedules.map((schedule) => (
-            <option key={schedule.id} value={schedule.id}>
-              {yyyyqToQyy(schedule.quarter)} {schedule.name}
-            </option>
-          ))}
+        {true}
       </Form.Control>
     </Form.Group>
killedBy: PersonalScheduleSelector sets the initial schedule from the schedule prop
statusReason: TestingLibraryElementError: Unable to find an element with the display value: S24 Schedule 1.

<body>
  <div>
    <div>
      <label
        class="form-label"
      >

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleSelector.js:39:10
         value={scheduleState}
         onChange={handleScheduleOnChange}
       >
-        {filteringSchedules &&
-          filteringSchedules.map((schedule) => (
-            <option key={schedule.id} value={schedule.id}>
-              {yyyyqToQyy(schedule.quarter)} {schedule.name}
-            </option>
-          ))}
+        {false}
       </Form.Control>
     </Form.Group>
killedBy: PersonalScheduleSelector sets the initial schedule from the schedule prop
statusReason: TestingLibraryElementError: Unable to find an element with the display value: S24 Schedule 1.

<body>
  <div>
    <div>
      <label
        class="form-label"
      >

[Killed] ArrowFunction
main/components/PersonalSchedules/PersonalScheduleSelector.js:40:34
         onChange={handleScheduleOnChange}
       >
         {filteringSchedules &&
-          filteringSchedules.map((schedule) => (
-            <option key={schedule.id} value={schedule.id}>
-              {yyyyqToQyy(schedule.quarter)} {schedule.name}
-            </option>
-          ))}
+          filteringSchedules.map(() => undefined)}
       </Form.Control>
     </Form.Group>
killedBy: PersonalScheduleSelector sets the initial schedule from the schedule prop
statusReason: TestingLibraryElementError: Unable to find an element with the display value: S24 Schedule 1.

<body>
  <div>
    <div>
      <label
        class="form-label"
      >
