[Killed] BlockStatement
main/components/Sections/SectionsTable.js:31:16
     (section) => section.section.enrollCode === enrollCode,
   );
 
-  if (section) {
-    // Extract the courseId and section number from the found section
-    const courseId = section.courseInfo.courseId;
-    const sectionNumber = section.section.section;
-    const courseSections = sections.filter(
-      (section) => section.courseInfo.courseId === courseId,
-    );
-    const timeLocations = section.section.timeLocations;
-
-    // Check if the section number is '0100', indicating a lecture
-    if (sectionNumber === "0100") {
-      // Filter all sections with the same courseId
-      // Stryker disable all
-      // Stryker restore all
-      // Check if there is only one section for the course
-      return courseSections.length === 1;
-    } else if (sectionNumber.slice(-2) === "00") {
-      // Check if the section has a location to make sure its a course
-      return (
-        courseSections.length === 1 && typeof timeLocations !== "undefined" && timeLocations.length == 1
-      );
-    }
-  }
+  if (section) {}
 
   return false;
killedBy: isLectureWithNoSections should return true when the section is a lecture with no other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:50:40
     } else if (sectionNumber.slice(-2) === "00") {
       // Check if the section has a location to make sure its a course
       return (
-        courseSections.length === 1 && typeof timeLocations !== "undefined" && timeLocations.length == 1
+        courseSections.length === 1 && true && timeLocations.length == 1
       );
     }
killedBy: isLectureWithNoSections should return false when the section number ends in 00 and is not 0100 and does not have a location
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
main/components/Sections/SectionsTable.js:50:9
     } else if (sectionNumber.slice(-2) === "00") {
       // Check if the section has a location to make sure its a course
       return (
-        courseSections.length === 1 && typeof timeLocations !== "undefined" && timeLocations.length == 1
+        courseSections.length !== 1 && typeof timeLocations !== "undefined" && timeLocations.length == 1
       );
     }
killedBy: isLectureWithNoSections should return true when the section number ends in 00 and is not 0100 and has a location
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
