[Killed] BlockStatement
main/components/Sections/SectionsTable.js:52:61
   return false;
 }
 
-export function isLectureWithSections(enrollCode, sections) {
-  // Find the section with the given enrollCode
-  const section = sections.find(
-    (section) => section.section.enrollCode === enrollCode,
-  );
-
-  if (section) {
-    // Extract the courseId and section number from the found section
-    const courseId = section.courseInfo.courseId;
-    const sectionNumberEnd = section.section.section.slice(2);
-
-    if (sectionNumberEnd === "00") {
-      // Filter all sections with the same courseId
-      // Stryker disable all
-      const courseSections = sections.filter(
-        (section) => section.courseInfo.courseId === courseId,
-      );
-      // Stryker restore all
-      // Check if there is only one section for the course
-      return courseSections.length > 1;
-    }
-  }
-
-  return false;
-}
+export function isLectureWithSections(enrollCode, sections) {}
 
 export const objectToAxiosParams = (data) => {
killedBy: isLectureWithSections should return false when the section is a lecture with no other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined
